# read design
read_verilog -lib counter.v
read_verilog unlock.v

# elaborate design hierarchy
hierarchy -check -top unlock

# the high-level stuff
proc; tribuf; opt; fsm; opt; memory; opt

# mapping to internal cell library
# this maps the design circuit to one bit gates, do not use this!!!
# techmap; opt

# cleanup
clean

write_json connections.json

# view the resulting schematic
show -colors 1 -stretch -prefix schematic unlock
