# read design
read_verilog counter.v
read_verilog -noopt unlock.v


write_verilog unlock
# elaborate design hierarchy
hierarchy -check

# the high-level stuff
proc; opt; fsm; opt; memory; opt

# mapping to internal cell library
# this maps the design circuit to one bit gates, do not use this!!!
# techmap; opt

# cleanup
clean


write_json fisierulmeu

# view the resulting schematic
show -colors 1 -stretch -prefix schematic unlock