# read design
read_verilog -lib adder.v
read_verilog -lib subtractor.v
read_verilog -lib multiplier.v
read_verilog alu.v

# elaborate design hierarchy
hierarchy -check -top alu

# the high-level stuff
proc; tribuf; opt; fsm; opt; memory; opt

# mapping to internal cell library
# this maps the design circuit to one bit gates, do not use this!!!
# techmap; opt

# cleanup
clean

write_json alu.json

# view the resulting schematic
show -colors 1 -stretch -prefix schematic alu
