# read design
read_verilog one_adder.v

# elaborate design hierarchy
hierarchy -check -top one_adder

# the high-level stuff
proc; tribuf; opt; fsm; opt; memory; opt

# mapping to internal cell library
# this maps the design circuit to one bit gates, do not use this!!!
# techmap; opt

# cleanup
clean

write_json one_adder.json

# view the resulting schematic
show -colors 1 -stretch -prefix schematic one_adder
