# read design
read_verilog multiplier_with_op.v

# elaborate design hierarchy
hierarchy -check -top multiplier_with_op

# the high-level stuff
proc; tribuf; opt; fsm; opt; memory; opt

# mapping to internal cell library
# this maps the design circuit to one bit gates, do not use this!!!
# techmap; opt

# cleanup
clean

write_json multiplier_with_op.json

# view the resulting schematic
show -colors 1 -stretch -prefix schematic multiplier_with_op
